public/getLNData.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns1="http://ru/ibs/fss/ln/ws/FileOperationsLn.wsdl"><S:Header><wsse:Security S:actor="http://eln.fss.ru/actor/mo/1022401590573" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="http://eln.fss.ru/actor/mo/1022401590573">MIIGSzCCBfqgAwIBAgIQAdNMbd50DNAAAAAQAAUAATAIBgYqhQMCAgMwgeoxLzAt
BgNVBAoMJtCi0LXRgdGC0L7QstGL0Lkg0KPQpiDQmNC90YTQvtCi0LXQmtChMUQw
QgYDVQQLDDvQo9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC5INC4INC60LvRjtGH
0LXQstC+0Lkg0YbQtdC90YLRgDEjMCEGA1UEDAwa0JDQtNC80LjQvdC40YHRgtGA
0LDRgtC+0YAxTDBKBgNVBAMMQ9CQ0LTQvNC40L3QuNGB0YLRgNCw0YLQvtGAINCi
0LXRgdGC0L7QstC+0LPQviDQo9CmINCY0L3RhNC+0KLQtdCa0KEwHhcNMTcxMDI0
MDIxNDAwWhcNMTgxMDIwMjA1OTU5WjCCAjwxIDAeBgNVBAwMF9CT0LvQsNCy0L3R
i9C5INCy0YDQsNGHMRkwFwYDVQQEDBDQmNC70YzQtdC90LrQvtCyMTAwLgYDVQQJ
DCfRg9C7LiDQuNC8LiDQmC7QoS7QndC40LrQuNGC0LjQvdCwLCAx0JIxLTArBgNV
BAgMJDI0INCa0YDQsNGB0L3QvtGP0YDRgdC60LjQuSDQutGA0LDQuTFRME8GA1UE
CgxI0JrQk9CR0KPQlyDQmtCa0J7QmtCRINC40LwuINC/0YDQvtGE0LXRgdGB0L7R
gNCwINCfLtCTLiDQnNCw0LrQsNGA0L7QstCwMSMwIQYDVQQLDBrQkNC00LzQuNC9
0LjRgdGC0YDQsNGG0LjRjzEhMB8GA1UEBwwY0LMuINCa0YDQsNGB0L3QvtGP0YDR
gdC6MRYwFAYFKoUDZAMSCzEyNzg1MzI2NzgzMRgwFgYFKoUDZAESDTExMDI0Njgw
MTYyMzIxGjAYBggqhQMDgQMBARIMMDAyNDY1MjM1MTgyMTYwNAYDVQQqDC3QodGC
0LDQvdC40YHQu9Cw0LIg0KHRgtCw0L3QuNGB0LvQsNCy0L7QstC40YcxGzAZBgkq
hkiG9w0BCQEWDG1haWxAbWFpbC5ydTELMAkGA1UEBhMCUlUxUTBPBgNVBAMMSNCa
0JPQkdCj0Jcg0JrQmtCe0JrQkSDQuNC8LiDQv9GA0L7RhNC10YHRgdC+0YDQsCDQ
ny7Qky4g0JzQsNC60LDRgNC+0LLQsDBjMBwGBiqFAwICEzASBgcqhQMCAiQABgcq
hQMCAh4BA0MABEAddQnA1eqDWwo6+dM14mPvl78U+hLWWoMgP502iFwxPWng9ieT
4SO9NrweD25Dii2G9Efgu5ceE3c+y3zLoEhOgQkAMDAwNTAwMDGjggIYMIICFDAO
BgNVHQ8BAf8EBAMCBPAwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMEMB0G
A1UdDgQWBBTythcqm5sSikYb0EgV1w4JDHMFozAMBgNVHRMBAf8EAjAAMIIBKAYD
VR0jBIIBHzCCARuAFC34Jde692hgk7Y33SVq6a2F9s4foYHwpIHtMIHqMS8wLQYD
VQQKDCbQotC10YHRgtC+0LLRi9C5INCj0KYg0JjQvdGE0L7QotC10JrQoTFEMEIG
A1UECww70KPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQuSDQuCDQutC70Y7Rh9C1
0LLQvtC5INGG0LXQvdGC0YAxIzAhBgNVBAwMGtCQ0LTQvNC40L3QuNGB0YLRgNCw
0YLQvtGAMUwwSgYDVQQDDEPQkNC00LzQuNC90LjRgdGC0YDQsNGC0L7RgCDQotC1
0YHRgtC+0LLQvtCz0L4g0KPQpiDQmNC90YTQvtCi0LXQmtChghAB00mhXFwf4AAA
AA4ABQABMGIGCiqFAwIEAQEBAQYEVDBSpFAwTjEvMC0GA1UECgwm0KLQtdGB0YLQ
vtCy0YvQuSDQo9CmINCY0L3RhNC+0KLQtdCa0KExGzAZBgNVBAMMElJlZ2lzdHJh
dGlvbiBQb2ludDAmBgoqhQMCBAEBAQEHBBgwFoAU++viyabo1wRVvYHBEK06E20J
7GIwCAYGKoUDAgIDA0EAhKvp4qI/OJUsKWDlS84NIGHENAJGaju7plpwk0oPR/X7
7T/p6t9OAaYMWSR2++12Yiz8AsrB7DyScRxTaiaeqQ==</wsse:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/><SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><Reference URI="#OGRN_1022401590573"><DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><DigestValue>Zr/B93FCxBFvAQhOfSHEgcWUfqHtKCuwbVxjsJ2TRt0=</DigestValue></Reference></SignedInfo><SignatureValue>1V/I8Z4ARYx97SUUGbe+4MaywSGJsB3zxmqvOPGN3FtZVwqeFv3PJkzs5qiVglXnVOCTM8+qJxpS4zkxo9sOfg==</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#http://eln.fss.ru/actor/mo/1022401590573" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></S:Header><S:Body wsu:Id="OGRN_1022401590573"><ns1:getLNData xmlns:ns1="http://ru/ibs/fss/ln/ws/FileOperationsLn.wsdl"><ns1:ogrn>1022401590573</ns1:ogrn><ns1:lnCode>280934020638</ns1:lnCode><ns1:snils>04060516103</ns1:snils></ns1:getLNData></S:Body></S:Envelope>